{
    "displayPicture": "DSC_1981.jpeg",
    "name": "Prajwal Kotian",
    "designation": "Technical Specialist",
    "addressLine1": "4-82B, PRANAM, Classic Chaya Building",
    "addressLine2": "4th Cross Nayampalli, Santhekatte",
    "city": "Udupi",
    "state": "Karnataka",
    "country": "India",
    "pinCode": 576105,
    "phoneNumber": "+91-8237408816",
    "email": "kotian.prajwal821@gmail.com",
    "linkedInURL": "https://www.linkedin.com/in/prajwal-kotian-4ba4898",
    "gitHubURL": "https://github.com/prajju25",
    "skills": [{
        "name": "ReactJS",
        "rating": 4
    },{
        "name": "Redux",
        "rating": 3
    },{
        "name": "Angular 2+",
        "rating": 4
    },{
        "name": "AngularJS",
        "rating": 2
    },{
        "name": "JavaScript",
        "rating": 4
    },{
        "name": "Java",
        "rating": 3
    },{
        "name": "SpringBoot",
        "rating": 3
    },{
        "name": "HTML5",
        "rating": 3
    },{
        "name": "CSS3",
        "rating": 3
    },{
        "name": "Solidity",
        "rating": 2
    },{
        "name": "NodeJS",
        "rating": 2
    },{
        "name": "Oracle",
        "rating": 3
    },{
        "name": "MongoDB",
        "rating": 2
    },{
        "name": "AWS",
        "rating": 1
    }],
    "description": "Experienced Full stack developer having an experience of 7.4 years in IT industry. Have expertise working in UI libraries and frameworks like React, Redux, Angular (Above 2+, Angular JS). Have backend knowledge on frameworks like Node Js, Spring Boot and spring. Experience working in different agile process like Scrum Agile, SAFE Agile and also worked in Waterflow model. Expertise in web accessibility of the UI pages. Have experience in fixing issues related to accessibility (CATO and e508 compliance). Have exposure working in Jenkins, CI-CD pipelines integrated with Jenkins and cloud platform like AWS for deployment.",
    "workHistory": [{
        "role": "Technical Specialist",
        "startDate": "2021-04",
        "endDate": "current",
        "companyName": "Brillio",
        "location": "Bangalore",
        "description": ["As offshore Lead, guided team on achieving targeted deliverables for sprint.",
        "Performed role of UI SMEs in project.",
        "Built new react application from scratch. Created new components like search table with filters.",
        "Implemented new spring boot service and created Rest APIs for displaying data in UI.",
        "Working as Full Stack Developer helped team contributing in both front-end and back-end.",
        "Handled performance related issues in application.",
        "Technologies Used: React JS, Redux, Spring Boot, Eureka, Oracle and PLSQL"]
    },{
        "role": "Application Development Team Lead",
        "startDate": "2019-12",
        "endDate": "2021-04",
        "companyName": "Accenture Solutions Private Ltd",
        "location": "Bangalore",
        "description": ["Worked as Full Stack Team Lead and also guiding team as Full Stack SME.",
        "Created reusable components in angular 9 and also developed product recommendations page.",
        "Migrated spring boot application caching mechanism from Hazel-cast to Redis.",
        "Implemented Apache Kafka for publishing recommendations to third party systems.",
        "Providing estimations and assigning story points for each story.",
        "Technologies used: Angular 9, Spring Boot, REDIS, Apache Kafka and Cassandra."]
    },{
        "role": "Application Development Senior Analyst",
        "startDate": "2017-12",
        "endDate": "2019-1",
        "companyName": "Accenture Solutions Private Ltd",
        "location": "Bangalore",
        "description": ["Technical POC and one of UI SME in SLA Reporting project and working with team of 9-10 people from last 8 sprints",
        "Successfully migrated web application to Angular 8 from AngularJS for multiple application modules.",
        "Come up with overall design and create design document and interface specification documents. Web Service Integrations for all new products across Map and Maintenance modules.",
        "Gave KT on CATO (Corporate Accessibility Technology Office) which ensures clients products and services are accessible to all their customers",
        "Developed single sign on into b2b application for clients who uses SLA reports.",
        "Knowledge transfer of application functional/technical flows to new team members. Mentor junior team members and up skill newcomers.",
        "Directly working with the client in a team of 12 members. Involved in requirements and design calls with all AT&T stakeholders including Business and Architects",
        "Received appreciation from clients to the Angular Migration team for increasing the performance of the page in production by 30%",
        "Technologies Used: Angular 8, node JS, AngularJS, JavaScript, Spring Boot and MongoDB."]
    },{
        "role": "Application Developer Analyst",
        "startDate": "2014-09",
        "endDate": "2017-12",
        "companyName": "Accenture Solutions Private Ltd",
        "location": "Bangalore",
        "description": ["Responsible for development of different functionalities based on scenarios given by Business Analyst.",
        "Involved in identifying E2E scenario and creating reusable methods and generic methods.",
        "Worked on designing UI pages based on client requirement. Provided solutions on resolving web accessibility issues of page.",
        "Fixed major CATO issues that was reported by organization. Resolved 508 violations reported on application.",
        "Showed responsibility on supporting module until production release.",
        "Developed major functionality which are right now live and available to 9000+ customers.",
        "Technologies Used: Angular, Spring Boot, spring, MongoDB, Oracle and ATG."]
    }],
    "education": [{
        "courseName": "Bachelor of Engineering: Instrumentation Technology",
        "startDate": "2010-09",
        "endDate": "2014-07",
        "schoolName": "MS Ramaiah Institute of Technology - Bengaluru",
        "isPercentage": false,
        "marks": 8.17
    },{
        "courseName": "HSC",
        "startDate": "2008-06",
        "endDate": "2010-04",
        "schoolName": "Vidhyodhaya Pre-University College - Karnataka, India",
        "isPercentage": true,
        "marks": 76.5
    },{
        "courseName": "SSC",
        "startDate": "2007-05",
        "endDate": "2008-04",
        "schoolName": "St Mary's English Medium School - Karnataka, India",
        "isPercentage": true,
        "marks": 81.76
    }],
    "accomplishments": ["Received \"Brillian of the Quarter\" on December 2021 for the excellence.",
    "Received \"Brillio Special Awards\" on January 2022 for the support provided on projects.",
    "Received award on Tech Star from Accenture on 2018 for my enhancement of skills on UI technologies."],
    "certifications": [{
        "certificateName": "Certified SAFe 4 Practitioner",
        "completedDate": "2018-07"
    }],
    "interests": ["Bike riding",
    "Cooking",
    "Photography"]
}